### Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
a_list = ([3, 217, 182])
a_list

[3, 217, 182]

In [3]:
a = pd.Series(a_list)
a

0      3
1    217
2    182
dtype: int64

In [4]:
a_index = ['a', 'b', 'c']

In [5]:
a_w_index = pd.Series(a_list, index = a_index)
a_w_index

a      3
b    217
c    182
dtype: int64

In [6]:
b_dict = {'cat': 'Norma', 'dog': 'Fozzie', 'fish' : 'Al'}
b_dict

{'cat': 'Norma', 'dog': 'Fozzie', 'fish': 'Al'}

In [7]:
b =pd.Series(b_dict)
b

cat      Norma
dog     Fozzie
fish        Al
dtype: object

In [8]:
data = {
    'product_num' : [1658, 2476, 3911],
    'quantity' :[120, 54, 98]
}

In [9]:
df = pd.DataFrame(data)
print(df)

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [10]:
df

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [11]:
df.to_string()

'   product_num  quantity\n0         1658       120\n1         2476        54\n2         3911        98'

In [12]:
df01 = pd.DataFrame((1,2,3,4))
df01

   0
0  1
1  2
2  3
3  4

In [13]:
arr = np.array([1,2,3,4])
df02 = pd.DataFrame(arr)
df02

   0
0  1
1  2
2  3
3  4

In [14]:
ser = pd.Series(arr)
df03 = pd.DataFrame(ser)
df03

   0
0  1
1  2
2  3
3  4

In [15]:
arr2 = np.array([[1,2,3,4]])
df04 = pd.DataFrame(arr2)
df04

   0  1  2  3
0  1  2  3  4

In [16]:
df04.insert(2, 'A', ['a'])
df04.insert(5, 'D', ['d'])
df04

   0  1  A  2  3  D
0  1  2  a  3  4  d

In [17]:
# NumPy Sampling

sampledata = pd.DataFrame(np.arange(8).reshape((2,4)), index =['apple','banana'], columns = ['a','b','c','d'])
sampledata

        a  b  c  d
apple   0  1  2  3
banana  4  5  6  7

In [18]:
sampledata['banana':]

        a  b  c  d
banana  4  5  6  7

### Using.loc[] and .iloc[]

In [19]:
df

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [20]:
print(df.loc[1])
print(type(df.loc[1]))

product_num    2476
quantity         54
Name: 1, dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
print(type(df.loc[1:2]))
df.loc[1:2]

<class 'pandas.core.frame.DataFrame'>

   product_num  quantity
1         2476        54
2         3911        98

In [22]:
sampledata

        a  b  c  d
apple   0  1  2  3
banana  4  5  6  7

In [23]:
sampledata.loc[2] = [11,12,13,14]
sampledata

         a   b   c   d
apple    0   1   2   3
banana   4   5   6   7
2       11  12  13  14

In [24]:
sampledata.iloc[1:]

         a   b   c   d
banana   4   5   6   7
2       11  12  13  14

### Reading FIles into a DataFrame

In [25]:
#available file formats for import include .txt, .csv, .json, .xlsx

### Cleaning data with pandas

In [26]:
df

   product_num  quantity
0         1658       120
1         2476        54
2         3911        98

In [27]:
df_filt = df[(df['quantity'] < 100)]
df_filt

   product_num  quantity
1         2476        54
2         3911        98

In [28]:
df.replace({'quantity' : 54}, 77, inplace = True)
df

   product_num  quantity
0         1658       120
1         2476        77
2         3911        98

In [29]:
df = df.fillna(130)
df

   product_num  quantity
0         1658       120
1         2476        77
2         3911        98

In [30]:
df['product_num'] = df.product_num.fillna(130)
df

   product_num  quantity
0         1658       120
1         2476        77
2         3911        98

### Working with Data